Cho topo như hình vẽ, chúng ta sẽ cấu hình network trên proxmox và thiết bị switch cisco mục đích mô phỏng multi vlan
  
  <img src="proxmoximages/Screenshot_161.png">

## Mô tả

Thiết bị sw cisco chạy 3 vlan là vlan 1 100 200

Với vlan 1 là vlan cho các máy ảo hoặc node Proxmox ra internet, các vlan 100 và 200 mục đích chỉ là mô phỏng

## 

Trên thiết bị switch cisco mình cấu hình như sau, đầu tiên chúng ta ssh vào switch theo IP 172.16.9.14 với tài khoản admin và pass 12345678aA@

Khai báo thêm 2 vlan 100 và vlan 200

#############################################
    Switch(config)#vlan 100
    Switch(config-vlan)#name VlanProxmoxCephLocal1
    Switch(config-vlan)#exit

    Switch(config)#vlan 200
    Switch(config-vlan)#name VlanProxmoxCephLoca2
    Switch(config-vlan)#exit

#############################################

    Switch(config)#interface GigabitEthernet 1/0/11
    Switch(config-if)#description -> 172.16.9.111
    Switch(config-if)#no shutdown 

    Switch(config)#interface GigabitEthernet 1/0/13
    Switch(config-if)#description -> 172.16.9.112
    Switch(config-if)#no shutdown 

    Switch(config)#interface GigabitEthernet 1/0/15
    Switch(config-if)#description -> 172.16.9.113
    Switch(config-if)#no shutdown 

##############################################

    Switch(config)#interface GigabitEthernet 1/0/12
    Switch(config-if)#description -> 10.10.100.111
    Switch(config-if)#no shutdown 
    swcore1(config-if)#sw trunk encapsulation dot1q
    Switch(config-if)#switchport mode trunk
    swcore1(config-if)#switchport trunk allowed vlan 100,200

#################################################
    Switch(config)#interface GigabitEthernet 1/0/14
    Switch(config-if)#description -> 10.10.100.112
    Switch(config-if)#no shutdown 
    swcore1(config-if)#sw trunk encapsulation dot1q
    Switch(config-if)#switchport mode trunk
    swcore1(config-if)#switchport trunk allowed vlan 100,200

##################################################

    Switch(config)#interface GigabitEthernet 1/0/16
    Switch(config-if)#description -> 10.10.100.113
    Switch(config-if)#no shutdown 
    swcore1(config-if)#sw trunk encapsulation dot1q
    Switch(config-if)#switchport mode trunk
    swcore1(config-if)#switchport trunk allowed vlan 100,200

#################################################

Switch(config)#ip routing

#################################################
Switch(config)#end
Switch#write memory 
Building configuration...
[OK]